temperatureTest/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water vapour);

thermoPhaseChangeTwoPhaseMixture SchnerrSauer;

pSat            2300;   // Saturation pressure

sigma           0.07;

lHeat		2260000; // Latent heat

//DT		DT [0 2 -1 0 0 0 0] 0.002;

water
{
    transportModel  Newtonian;
    nu              9e-07;
    rho             1000;
    Cp		    4.2e3;
    kappa	    0.03;
}

vapour
{
    transportModel  Newtonian;
    nu              4.273e-04;
    rho             0.02308;
    Cp		    1.525;
    kappa           0.025;
}

KunzCoeffs
{
    UInf            U20.0;
    tInf            t0.005; // L = 0.1 m
    Cc              C1000;
    Cv              C1000;
}

MerkleCoeffs
{
    UInf            20.0;
    tInf            0.005;  // L = 0.1 m
    Cc              80;
    Cv              1e-03;
}

SchnerrSauerCoeffs
{
    n               1.6e+13;
    dNuc            2.0e-06;
    Cc              1;
    Cv              1;
}


// ************************************************************************* //
