temperatureTest/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             myInterPhaseChangeFoam;

startFrom               latestTime;

startTime               0;

stopAt                  endTime;

endTime                 1e-3;

deltaT                  1e-8;

writeControl            adjustableRunTime;

writeInterval           1e-7;

purgeWrite              0;

writeFormat             ascii;

writePrecision          6;

writeCompression        off;

timeFormat              general;

runTimeModifiable       yes;

adjustTimeStep          on;

maxCo                   5;
maxAlphaCo              2;

// ************************************************************************* //
